# Accesing Data

Find 3 datasets of interest to you that are provided in different file formats. Choose datasets that are not too big, so that they do not take more than a few second to load. At least one dataset, must have non numerical (eg string or boolean) data in at least 1 column. Complete a dictionary for each with the url, a name, and what function should be used to load the data into a pandas.DataFrame.

In [104]:
# imports
import pandas as pd

In [105]:
# Three disctionaries for three websites

d1 = {'url':'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp',
     'name': 'rankings_by_country',
     'load_func': lambda URL: pd.read_html(URL)[1]}
                                   
#what function should be used to load the data into a pandas.DataFrame
#.what should be input of func?url?
    
d2 = {'url': 'https://en.wikipedia.org/wiki/List_of_best-selling_music_artists' ,
     'name': 'List_of_best-selling_music_artists' ,
     'load_func': lambda URL: pd.read_html(URL)[0]}

d3 = {'url': 'https://finance.yahoo.com/quote/TSLA/history' ,
     'name': 'history',
     'load_func': lambda URL: pd.read_html(URL)[0]}
#d3['url']

In [106]:
# Making a list of dictionaries

datasets_info_dict =[d1, d2, d3]

## Dataset summary

In [107]:
website_1 = pd.read_html(d1['url'])

In [108]:
# df1 is the second index of website_1 list
df1 = d1['load_func'](d1['url'])

In [109]:
type(df1)

pandas.core.frame.DataFrame

In [110]:
df1.shape

(82, 11)

In [111]:
# Showing the first five components of data frame (df1)

df1.head()

,Rank,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
0,NaN,Denmark,192.53,101.27,73.91,80.17,85.02,6.96,28.93,21.52,81.80
1,NaN,Switzerland,190.92,114.83,78.42,73.10,125.69,8.52,28.93,21.89,80.05
2,NaN,Finland,186.40,93.94,74.47,75.96,72.71,8.69,29.41,11.79,59.21
3,NaN,Australia,185.03,103.38,58.33,77.81,75.89,7.44,35.00,23.22,94.20
4,NaN,Netherlands,184.18,86.76,72.85,75.68,74.63,7.45,28.15,26.11,87.53

In [112]:
# Showing the last five components of data frame (df1)

df1.tail()

,Rank,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
77,NaN,Philippines,79.18,21.38,57.78,67.52,39.25,29.92,44.60,74.24,61.11
78,NaN,Iran,70.32,21.88,51.09,52.23,38.47,29.83,47.44,76.69,70.99
79,NaN,Kenya,66.60,28.98,38.27,55.58,37.75,36.33,56.96,76.56,99.79
80,NaN,Bangladesh,66.29,27.59,36.18,43.08,33.41,14.30,59.01,85.83,72.91
81,NaN,Nigeria,54.91,11.10,36.73,50.05,29.76,16.19,62.14,86.89,60.75

### Display the heading with the last seven rows

In [113]:
df1.tail(7)

,Rank,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
75,NaN,Peru,85.28,30.66,34.35,56.45,37.64,15.57,48.81,83.34,97.69
76,NaN,Sri Lanka,80.36,21.42,59.77,72.44,32.93,34.98,56.95,60.03,59.11
77,NaN,Philippines,79.18,21.38,57.78,67.52,39.25,29.92,44.60,74.24,61.11
78,NaN,Iran,70.32,21.88,51.09,52.23,38.47,29.83,47.44,76.69,70.99
79,NaN,Kenya,66.60,28.98,38.27,55.58,37.75,36.33,56.96,76.56,99.79
80,NaN,Bangladesh,66.29,27.59,36.18,43.08,33.41,14.30,59.01,85.83,72.91
81,NaN,Nigeria,54.91,11.10,36.73,50.05,29.76,16.19,62.14,86.89,60.75

### make and display a new data frame with only the non numerical columns

In [114]:
df1.select_dtypes(exclude='number').style.hide_index()

In [115]:
df1.index

RangeIndex(start=0, stop=82, step=1)

In [116]:
df1.describe()

,Rank,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
count,0.0,82.000000,82.000000,82.000000,82.000000,82.000000,82.000000,82.000000,82.000000,82.000000
mean,NaN,131.969146,56.062805,60.637561,64.774268,52.412317,13.549512,35.952927,53.490854,77.229268
std,NaN,33.609472,25.868711,13.678326,9.918447,20.248250,7.516185,8.243301,20.627157,16.185653
min,NaN,54.910000,11.100000,22.710000,43.080000,21.000000,2.720000,20.100000,11.790000,20.220000
25%,NaN,105.132500,33.717500,52.810000,56.697500,36.642500,8.705000,29.920000,37.675000,68.970000
50%,NaN,131.235000,51.425000,59.880000,65.910000,49.060000,11.835000,35.020000,57.300000,78.850000
75%,NaN,158.385000,79.202500,71.682500,72.500000,68.597500,16.035000,39.750000,67.425000,89.862500
max,NaN,192.530000,114.830000,88.100000,86.420000,125.690000,43.520000,62.140000,88.910000,99.790000

### Was the format that the data was provided in a good format? why or why not?

Yes. Because it was provided in rows and columns and data type was consistent in each column.

In [117]:
website_2 = pd.read_html(d2['url'])

In [118]:
df2 = d2['load_func'](d2['url'])
df2

,Artist,Country / Market,Period active,Release year of first charted record,Genre,Total certified units(from available markets)[a],Claimed sales
0,The Beatles,United Kingdom,1960–1970[10],1962[10],Rock / Pop[10],Total available certified units: 281 million U...,600 million[38][39]500 million[40]
1,Elvis Presley,United States,1954–1977[41],1954[41],Rock and roll / Pop / Country[41],Total available certified units: 226.1 million...,600 million[50][51]500 million[52]
2,Michael Jackson,United States,1964–2009[53],1971[53],Pop / Rock / Dance / Soul / R&B[53],Total available certified units: 233 million U...,350 million[63][64]300 million[65][66]
3,Elton John,United Kingdom,1964–present[67],1969[67],Pop / Rock[67],Total available certified units: 193.1 million...,300 million[70][71]250 million[72][73]
4,Madonna,United States,1979–present[74],1982[74],Pop / Dance / Electronica[74],Total available certified units: 173.8 million...,300 million[80][81]275 million[82]
5,Led Zeppelin,United Kingdom,1968–1980[83],1969[83],Hard rock / Blues rock / Folk rock[83],Total available certified units: 141.3 million...,300 million[87][88]200 million[89][90]
6,Rihanna,BarbadosUnited States,2005–present[91],2005[91],R&B / Pop / Dance / Hip-hop[91],Total available certified units: 281.8 million...,250 million[96][97]
7,Pink Floyd,United Kingdom,"1965–1996, 2005, 2012–2014[98][99]",1967[98],Progressive rock / Psychedelic rock[98],Total available certified units: 121.5 million...,250 million[101][102]200 million[103]

### Display the heading and the first three rows

In [119]:
df2.head(3)

,Artist,Country / Market,Period active,Release year of first charted record,Genre,Total certified units(from available markets)[a],Claimed sales
0,The Beatles,United Kingdom,1960–1970[10],1962[10],Rock / Pop[10],Total available certified units: 281 million U...,600 million[38][39]500 million[40]
1,Elvis Presley,United States,1954–1977[41],1954[41],Rock and roll / Pop / Country[41],Total available certified units: 226.1 million...,600 million[50][51]500 million[52]
2,Michael Jackson,United States,1964–2009[53],1971[53],Pop / Rock / Dance / Soul / R&B[53],Total available certified units: 233 million U...,350 million[63][64]300 million[65][66]

### display the datatype for each column

In [120]:
df2.dtypes

Artist                                              object
Country / Market                                    object
Period active                                       object
Release year of first charted record                object
Genre                                               object
Total certified units(from available markets)[a]    object
Claimed sales                                       object
dtype: object

### Are there any variables where pandas may have read in the data as a datatype that’s not what you expect (eg a numerical column mistaken for strings)?

no. all columns include non numerical characters.

In [121]:
website_3= pd.read_html(d3['url'])

In [122]:
df3 = d3['load_func'](d3['url'])
df3

,Date,Open,High,Low,Close*,Adj Close**,Volume
0,"Sep 18, 2020",447.94,451.00,428.80,442.15,442.15,85995000
1,"Sep 17, 2020",415.60,437.79,408.00,423.43,423.43,76779200
2,"Sep 16, 2020",439.87,457.79,435.31,441.76,441.76,72279300
3,"Sep 15, 2020",436.56,461.94,430.70,449.76,449.76,97298200
4,"Sep 14, 2020",380.95,420.00,373.30,419.62,419.62,83020600
...,...,...,...,...,...,...,...
96,"May 05, 2020",157.96,159.78,152.44,153.64,153.64,84958500
97,"May 04, 2020",140.20,152.40,139.60,152.24,152.24,96185500
98,"May 01, 2020",151.00,154.55,136.61,140.26,140.26,162659000
99,"Apr 30, 2020",171.04,173.96,152.70,156.38,156.38,142359500
100,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...,*Close price adjusted for splits.**Adjusted cl...

In [123]:
df3['Date']

0                                           Sep 18, 2020
1                                           Sep 17, 2020
2                                           Sep 16, 2020
3                                           Sep 15, 2020
4                                           Sep 14, 2020
                             ...
96                                          May 05, 2020
97                                          May 04, 2020
98                                          May 01, 2020
99                                          Apr 30, 2020
100    *Close price adjusted for splits.**Adjusted cl...
Name: Date, Length: 101, dtype: object

## Display the first 5 even rows of the data for three columns of your choice

In [124]:
df3[['Date','Low', 'Volume']].loc[::2].head()
# df3.Date.Low.Volume.loc[::2].head() #Does not work!

           Date     Low     Volume
0  Sep 18, 2020  428.80   85995000
2  Sep 16, 2020  435.31   72279300
4  Sep 14, 2020  373.30   83020600
6  Sep 10, 2020  360.56   84930600
8  Sep 08, 2020  329.88  115465700

### Try reading it in with the wrong read_ function. If you had done this by accident, how could you tell?

In [125]:
website_3 = pd.read_csv('https://finance.yahoo.com/quote/TSLA/history')

ParserError: Error tokenizing data. C error: Expected 573 fields in line 13, saw 1562

I can undesrtand it by the error I am getting, as it says this fuction is not able to parse data

In [ ]:

type(d1)

 Use a list of those dictionaries to iterate over the datasets and build a table that describes them, with the following columns ['name','source','num_rows', 'num_columns','source_file_name']. The source column should be the url where you loaded the data from or the source if you downloaded it from a website first The source_file_name should be the part of the url after the last /, you should extract this programmatically. Display that summary table as a dataframe and save it as a csv, named dataset_summary.csv.

In [ ]:
a = []
b = []
c = []
d = []
e = []


for dic in datasets_info_dict:
    name_website = dic['name']
    address_website = dic['url'] 
    num_rows_df = dic['load_func'](dic['url'])[0]
    num_columns_df = dic['load_func'](dic['url'])[1]
#     if i==1:
#         num_rows_df = df1.shape[0]
#         num_columns_df = df1.shape[1]
#     elif i==2:
#         num_rows_df  = df2.shape[0]
#         num_columns_df = df2.shape[1]
#     elif i==3:
#         num_rows_df  = df3.shape[0]
#         num_columns_df = df3.shape[1]
    
    source_file_name_website = dic['url'].split('/')[-1]
    
    a.append(name_website)
    b.append(address_website)
    c.append(num_rows_df)
    d.append(num_columns_df)
    e.append(source_file_name_website)
    
    ex_dic = {'name' : a,
             'source' : b,
             'num_rows' : c,
             'num_columns' : d,
              'source_file_name' : e,
             }
columns = ['name', 'source', 'num_rows', 'num_columns', 'source_file_name']
index = ["d_1", "d_2", "d_3"]
df = pd.DataFrame(ex_dic, columns=columns, index=index)
df
df.to_csv('dataset_summary.csv') 
#print(ex_dic)

## (for the process skill)

### Make a list of a data science pipeline and denote which types of programming might be helpful at each staged. Include this in a markdown cell in the same notebook with your analysis'''

    1. O — Obtaining our data (MySQL)
    2. S — Scrubbing / Cleaning our data (Python or R)
    3. E — Exploring / Visualizing our data will allow us to find patterns and trends (Numpy, Matplotlib, Pandas or Scipy)
    4. M — Modeling our data will give us our predictive power as a wizard (Sci-kit Learn)
    5. N — Interpreting our data
    
[reference] (https://towardsdatascience.com/a-beginners-guide-to-the-data-science-pipeline-a4904b2d8ad3)